---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
source: html/da5944ec-af62-acbe-d39f-9bd7fe829ad8.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor Method

Constructs a copy of source object.

## Syntax (C#)
```csharp
public DirectContext3DHandleSettings(
	DirectContext3DHandleSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings`) - Source object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null